{"title":"Что нужно знать новичку в Linux: права доступа","summary":"Unix подобные операционные системы, в том числе и Linux, отличаются от других\nтем, что они не только многозадачны, но и многопользовательские. Например,\nесли Ваш компьютер подключен к сети или интернет, то другие пользователи могут\nзайти в систему через telnet или ssh и управлять ею. Также они могут запустить\nX Windows сервер и управлять системой с помощью графического интерфейса.\nИсходя из этого, должен существовать механизм, который защищает одного\nпользователя системы от другого.\n","author":"sstotskyi","categories":["linux","important"],"createdAt":"2011-10-07T13:00:00.000Z","meta":{"keywords":["linux","права доступа"]},"alias":"chto-nuzhno-znat-novichku-v-linux-prava-dostupa","content":"<p>Unix подобные операционные системы, в том числе и Linux, отличаются от других тем, что они не только многозадачны, но и многопользовательские.</p>\n<p>Это значит, что компьютером могут управлять одновременно несколько пользователей. Например, если Ваш компьютер подключен к сети или интернет, то другие пользователи могут зайти в систему через <strong>telnet</strong> или <strong>ssh</strong> и управлять ею. Удаленные пользователи также могут запустить X Windows сервер и управлять системой с помощью графического интерфейса. Исходя из этого, должен существовать механизм, который защищает одного пользователя системы от другого. Поэтому и было придумано разграничение прав доступа. Для управления ими в Linux существуют несколько команд:</p>\n<ul>\n<li><strong>chmod</strong> - изменяет права доступа на файл</li>\n<li><strong>su</strong> - позволяет временно стать супер юзером</li>\n<li><strong>chown</strong> - изменяет владельца файла</li>\n<li><strong>chgrp</strong> - изменяет группу файла</li>\n</ul>\n<h2 id=\"prava-dostupa-na-fajl\"><a name=\"prava-dostupa-na-fajl\" class=\"h-link\" href=\"#\"></a>Права доступа на файл</h2>\n<p>В Linux используется точно такая же схема прав доступа, как в Unix. Все файлы и директории имеют права доступа для владельца файла, для группы определенных пользователей и для всех остальных. Права могут быть выданы на чтение, запись и выполнение файла (т.е. запуск, как программы).</p>\n<p>Чтобы посмотреть права доступа на файл можно использовать команду <strong>ls</strong> с опцией <strong>l</strong></p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ ls -l web.rar \n-rw-r--r-- 1 enej enej 44750 2011-08-16 18:30 web.rar\n</code></pre>\n<p>Первая колонка как раз и отвечает за права доступа на файл. Проанализировав данный пример можно сказать</p>\n<ul>\n<li>файл <strong>web.rar</strong> принадлежит пользователю <strong>enej</strong></li>\n<li>владелец файла (т.е. enej) имеет право на его чтение и запись</li>\n<li>пользователи из группы enej могут только читать этот файл</li>\n<li>все другие пользователи могут только читать файл</li>\n</ul>\n<p>Посмотрим на права доступа на файл <strong>/bin/bash</strong></p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ ls -l /bin/bash \n-rwxr-xr-x 1 root root 875596 2009-09-14 08:09 /bin/bash\n</code></pre>\n<ul>\n<li>файл принадлежит суперпользователю и группе суперпользователя</li>\n<li>владелец файла может читать, писать и выполнять файл</li>\n<li>пользователи из группы и все другие пользователи могут читать и выполнять файл</li>\n</ul>\n<p>Права доступа делятся на 4 множества. Первый символ - означает тип файла, следующие 3 множества (состоят из 3 символов) определяют права доступа для владельца, группы и всех остальных. Если на месте буквы в правах стоит прочерк (<strong>-</strong>) - это значит что прав на выполнение этого действия нет.</p>\n<h2></h2>\n<pre><code class=\"hljs language-bash\"> -    rwx    r-x    r-x\n---  -----  -----  -----\n |     |      |      |\n |     |      |      +----  Права доступа для всех остальных\n |     |      |      \n |     |      +-----------  Права доступа для группы\n |     |\n |     +------------------  Права достува для владельца (<span class=\"hljs-built_in\">read</span>, write, execute)\n |\n +------------------------ Тип файла. <span class=\"hljs-string\">\"-\"</span> означет, что это обычный файл.\n                           <span class=\"hljs-string\">\"d\"</span> - директория. <span class=\"hljs-string\">\"l\"</span> - ссылка\n</code></pre>\n<h2 id=\"izmenenie-prav\"><a name=\"izmenenie-prav\" class=\"h-link\" href=\"#\"></a>Изменение прав</h2>\n<p>Команда <strong>chmod</strong> используется для изменения прав доступа на файл или директорию. Существует 2 способа, с помощью которых можно задавать права, но я предпочитаю использовать один из них. Если рассматривать настройки прав, как последовательность битов (как их рассматривает компьютер), то все окажется просто, например</p>\n<pre><code class=\"hljs language-bash\">rwx rwx rwx = 111 111 111\nrw- rw- rw- = 110 110 110\nrwx --- --- = 111 000 000\n</code></pre>\n<p>Т.е. наличие буквы - это единица, прочерк - ноль. Если эту последовательность перевести у восьмеричную систему исчисления (или если попроще, то перевести каждую тройку цифр из двоичной системы в десятичную, например, 111 = 22 + 21 + 20 = 4 + 2 + 1 = 7), то получим</p>\n<pre><code class=\"hljs language-php\">rwx rwx rwx = <span class=\"hljs-number\">777</span>\nrw- rw- rw- = <span class=\"hljs-number\">666</span>\nrwx --- --- = <span class=\"hljs-number\">700</span>\n</code></pre>\n<p>Именно такой формат чаще всего встречается при работе с правами доступа. Например, чтобы установить все права всем</p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ chmod 777 web.rar\n</code></pre>\n<p>Для тех кому это сложно понять поделюсь способом, который я сам использовал долгое время. Стоит запомнить, что права на чтение - это 4, на записть - 2, на выполнение - 1 и 0 - забрать права. И чтобы установить права для владельца только на чтение и у всех отобрать их, стоит поочередно складывать. Владелец (чтение): 4 + 0 +0 = 4, группа (нет прав): 0 + 0 + 0 = 0, все остальные (нет прав): 0 + 0 + 0 = 0, т.е. в нашем случае получаем 400.</p>\n<p>Есть другой формат задания прав, который понимает <strong>chmod</strong>. Например, добавить права на запись для группы</p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ chmod g+w web.rar\n</code></pre>\n<p>Убрать права на чтение и запись у всех остальных</p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ chmod o-rw web.rar\n</code></pre>\n<p>Или убрать права на выполнение для всех</p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ chmod a-x web.rar\n</code></pre>\n<p>Более детально об этот формат можно узнать в менуале (<strong>man chmod</strong>).</p>\n<p>Для директорий схема прав доступа работает также как и для файлов, за исключением прав на выполнение. Для каталогов установка права на выполнение означает разрешение на просмотр содержимого директории.</p>\n<h2 id=\"kak-stat-superyuzerom\"><a name=\"kak-stat-superyuzerom\" class=\"h-link\" href=\"#\"></a>Как стать суперюзером</h2>\n<p>Вообще не рекомендуется заходить и работать с системой под суперпользователем, поскольку можно наделать делов. По-этому на большинстве систем для рута не стоит пароль, чтобы под ним никто не вошел в систему. Но иногда приходится выполнять действия от имени рута и для этого существует 2 команды: <strong>su</strong> - позволяет стать суперюзером, <strong>sudo</strong> - позволяет выполнить команду от имени суперюзера.</p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ su\nPassword:\nroot@linux:/home/enej<span class=\"hljs-comment\">#</span>\n</code></pre>\n<p>После выполнения первой команды, система спросит у нас пароль, если мы ввели верный пароль, то становимся рутом (в Linux при вводе пароля не отображаются звездочки). Для того чтобы закончить сессию суперпользователя выполните команду <strong>exit</strong> (в системах с графической оболочкой Gnome, того же результата можно добиться, если нажать сочетание клавиш Ctrl + D). Не все пользователи могут выполнять эту команду! Обычно это пользователи какой-то группы.</p>\n<p>Если Вам надоело вводить пароль каждый раз при вызове команды <strong>su</strong>, то есть способ как этого избежать. В Ubuntu (в других может отличатся!) существует файл конфигурации <strong>/etc/pam.d/su</strong>, в котором можно написать (обычно оно уже написано и его нужно только раскомментировать)</p>\n<pre><code class=\"hljs language-bash\">auth       sufficient pam_wheel.so trust\n</code></pre>\n<p>Это значит, что все пользователи, которые состоят в группе <strong>wheel</strong>, могут вызывать команду <strong>su</strong> без ввода пароля. Для добавления пользователя в группу (и еще кое-что) используется команда <strong>usermod</strong>.</p>\n<h2 id=\"izmenyaem-vladelcza-fajla\"><a name=\"izmenyaem-vladelcza-fajla\" class=\"h-link\" href=\"#\"></a>Изменяем владельца файла</h2>\n<p>Для изменения владельца файла используется команда <strong>chown</strong>. Обычно для изменения владельца нужны права рута, по-этому сначала выполняем команду <strong>su</strong></p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ su\nroot@linux:/home/enej<span class=\"hljs-comment\"># chown some_user web.rar</span>\nroot@linux:/home/enej<span class=\"hljs-comment\"># exit</span>\n</code></pre>\n<p>При помощи команды <strong>chown</strong>, можно также изменить и группу, указав ее после имени пользователя следующим образом</p>\n<h2></h2>\n<pre><code class=\"hljs language-bash\">chown some_user:some_group web.rar\n</code></pre>\n<p>Изменяем группу на файл</p>\n<p>Для даной задачи используется команда <strong>chgrp</strong>. По своей семантике она аналогична команде <strong>chown</strong></p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ chgrp some_group web.rar\n</code></pre>\n<p><strong>P.S.</strong>: команды <strong>chmod</strong>, <strong>chown</strong>, <strong>chgrp</strong> в качестве аргумента могут принимать бесконечное множество файлов и директорий. Также они могут принимать опции (флаги). Одним из часто используемых флагов является <strong>-R</strong>, он означает рекурсивное применение команды на все файлы и подкаталоги. Например, чтобы убрать права на запись для группы из всех файлов и директорий каталога Books</p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ chmod -R g-w Books/\n</code></pre>\n<p>По мотивам <a href=\"http://linuxcommand.org\" target=\"_blank\" rel=\"noopener nofollow\">http://linuxcommand.org</a></p>","headings":[["prava-dostupa-na-fajl","Права доступа на файл"],["izmenenie-prav","Изменение прав"],["kak-stat-superyuzerom","Как стать суперюзером"],["izmenyaem-vladelcza-fajla","Изменяем владельца файла"]],"id":"chto-nuzhno-znat-novichku-v-linux-prava-dostupa"}