{"title":"Что нужно знать новичку в Linux: ls -l / или назначение основных директорий","summary":"Не можете найти иконку \"Мой компьютер\" в Linux? Не знаете, что значит куча\nдиректорий в корне? Не беспокойтесь! В этой статье можно познакомится со всеми\nосновными директориями и их назначением\n","author":"sstotskyi","categories":["devops","important"],"createdAt":"2011-10-04T15:15:00.000Z","meta":{"keywords":["linux","новичок","основные директории"]},"alias":"chto-nuzhno-znat-novichku-v-linux-ls--l---ili-naznachenie-osnovnykh-direktorij","content":"<p>Для начала поговорим о базовых командах для работы с файлами, чтобы вы могли посмотреть тип и содержимое системных файлов.</p>\n<h2 id=\"komandy-raboty-s-fajlami\"><a name=\"komandy-raboty-s-fajlami\" class=\"h-link\" href=\"#\"></a>Команды работы с файлами</h2>\n<p>Команда <strong>ls</strong> имеет несколько базовых флагов:</p>\n<ul>\n<li>\n<p><strong>ls -l</strong> - выводит содержимое директории в расширенном формате</p>\n<pre><code class=\"hljs language-bash\">enej@linux:~$ ls -l\ntotal 444\ndrwxr-xr-x  3 enej enej   4096 2011-07-04 19:45 bin\ndrwxr-xr-x  8 enej enej   4096 2011-05-01 10:44 Books\ndrwxr-xr-x  7 enej enej   4096 2011-10-03 08:31 Desktop\ndrwxr-xr-x  6 enej enej   4096 2011-07-19 17:43 Documents\ndrwxr-xr-x  7 enej enej   4096 2011-10-02 12:41 Downloads\n............................................................\n</code></pre>\n</li>\n<li>\n<p><strong>ls -la</strong> - делает тоже что и предыдущая команда + показывает все скрытые файлы (имена скрытых файлов в Linux начинаются из символа точки &quot;<strong>.</strong>&quot;)</p>\n</li>\n</ul>\n<p>Посмотрим поближе на расширенный формат.</p>\n<pre><code class=\"hljs language-bash\">drwxr-xr-x  7    enej     enej     4096   2011-10-03 08:31   Desktop\ndrwxr-xr-x  6    enej     enej     4096   2011-07-19 17:43   Documents\ndrwxr-xr-x  7    enej     enej     4096   2011-10-02 12:41   Downloads\n----------     -------  -------  -------- ----------------- -------------\n    |             |        |         |         |                  |\n    |             |        |         |         |               Имя файла/папки\n    |             |        |         |         |\n    |             |        |         |         +---  Дата последней модификации\n    |             |        |         |\n    |             |        |         +-------------  Размер (в байтах)\n    |             |        |\n    |             |        +-----------------------  Група\n    |             |\n    |             +--------------------------------  Пользователь\n    |\n    +----------------------------------------------  Права доступа на файл/папку\n</code></pre>\n<p>Команда <strong>less /path/to/file</strong> позволяет просматривать текстовые файлы. Файл отображается постранично. Перейти к следующей странице можно с помощью кнопки <strong>Page Down</strong>, к предыдуще - <strong>Page Up</strong>. Чтобы закрыть просмотр файла нажмите <strong>q</strong>. Для поиска по файлу нажмите <strong>/</strong> и потом введите текст, который нужно найти. Чтобы искать следующее совпадение нажмите <strong>n</strong>.</p>\n<p>По скольку в Linux &quot;все есть файлом&quot;, то очень полезным окажется команда <strong>file</strong>, которая определяет тип содержимого файла.</p>\n<pre><code class=\"hljs language-bash\">enej@linux:/home/pub/www/vv$ file viland.sql.bz2\nviland.sql.bz2: bzip2 compressed data, block size = 900k\n</code></pre>\n<p>Может показаться, что большинство файлов нельзя просмотреть с помощью обычной команды <strong>less</strong>, но к большому удивлению - можно. Например, конфигурационные файлы.</p>\n<p>Еще Вы вероятно заметите, что большинство фич операционной системы контролируется с помощью <strong>Shell</strong> скриптов. Да да, в Linux нет секретов.</p>\n<h2 id=\"struktura-direktorij-i-ih-naznachenie\"><a name=\"struktura-direktorij-i-ih-naznachenie\" class=\"h-link\" href=\"#\"></a>Структура директорий и их назначение</h2>\n<p>Откройте свой терминал и введите команду <strong>ls -l /</strong>, таким образом Вы увидите все корневые каталоги. Пора бы узнать, что каждый из них означает</p>\n<ul>\n<li><strong>/</strong> - корневая директория. В большинстве случаев просто содержит подкаталоги</li>\n<li><strong>/boot</strong> - здесь лежат загрузочные файлы, в том числе и ядро Linux. Имя ядра начинается с <strong>vmlinuz</strong></li>\n<li><strong>/etc</strong> - в этой директории хранятся все конфигурационные файлы, при чем их можно просмотреть как текстовые. Самые интересные из них:\n<ul>\n<li><strong>/etc/passwd</strong> - содержит информацию о всех пользователях системы (скриптовая оболочка, идентификатор, домашняя директория, ...)</li>\n<li><strong>/etc/fstab</strong> - содержит таблицу устройств, которые подключаются, когда система начинает загрузку. Здесь прописана информация о Вашых жестких дисках</li>\n<li><strong>/etc/hosts</strong> - хост файл. Содержит маппинг IP адресов соответствующих определенным доменам.</li>\n<li><strong>/etc/init.d/</strong> - каталог, который содержит скрипты запуска различных сервисов, например, сервер Apache или MySQL</li>\n</ul>\n</li>\n<li><strong>/bin</strong>, <strong>/usr/bin</strong> - в этих 2 каталогах содержится большинство программ для системы. Первый из которых содержит неотъемлемую часть без которых не возможна работа системы, а второй - программы пользователей системы</li>\n<li><strong>/sbin</strong>, <strong>/usr/sbin</strong> - содержат программы для системного администрирования, в большинстве случаев используются суперпользователем или как принято его называть рутом (root).</li>\n<li><strong>/usr</strong> - содержит файлы для поддержки пользовательских программ. Например\n<ul>\n<li><strong>/usr/share/X11</strong> - файлы относящиеся к графическому серверу окон</li>\n<li><strong>/usr/share/dict</strong> - словари для проверки орфографии (комманды <strong>look</strong> и <strong>ispell</strong>, менуал на них можна посмотреть с помощью команды <strong>man</strong> - <strong>man look</strong> или <strong>man ispell</strong>)</li>\n<li><strong>/usr/share/doc</strong> - документация для программ в различных форматах</li>\n<li><strong>/usr/share/man</strong> - менуалы</li>\n<li><strong>/usr/src</strong> - содержит исходники различных программ, которые также можно посмотреть и даже попробовать скомпилировать</li>\n<li><strong>/usr/local</strong> - этот каталог и его подкаталоги используются для хранения и установки пользовательских программ, которые не являются частью дистрибутива Linux</li>\n</ul>\n</li>\n<li><strong>/var</strong> - содержит файлы, которые изменяются во время работы системы.\n<ul>\n<li><strong>/var/log</strong> - часто изменяющиеся лог файлы. Нужно время от времени их просматривать, чтобы знать состояние системы. Если что-то произошло &quot;плохое&quot;, то информацию об ошибке следует искать в логах</li>\n<li><strong>/var/spool</strong> - используется для хранения файлов, которые стоят в очереди. Например, для отправки электронных писем или файлов, которые отправлены на печать.</li>\n</ul>\n</li>\n<li><strong>/lib</strong> - содержит файлы библиотек (похожие на DLL в Windows). Обычно имеют расширение <strong>.so</strong></li>\n<li><strong>/home</strong> - здесь хранятся домашние директории всех пользователей. Обычно только здесь они (пользователи) имеют право удалять или создавать файлы, что является хорошим тоном администрирования и держит систему в безопасности</li>\n<li><strong>/root</strong> - домашняя директория суперпользователя</li>\n<li><strong>/tmp</strong> - каталог, в котором любая программа может хранить свои временные файлы. Обычно кто угодно имеет доступ для записи/удаления/создания здесь файлов и директорий.</li>\n<li><strong>/dev</strong> - это одна из особенных директорий, она вообще не содержит файлов (имеется ввиду файлов в привычном смысле). Содержит устройства доступные системе. В Linux (Unix) устройства представляют собой файлы. Можно писать и читать на/с устройство, как обычный файл. Например, <strong>/dev/fd0</strong> - первый флоппи диск (floopy drive), а <strong>/dev/sda</strong> (<strong>/dev/hda</strong> на старых системах) первый IDE жесткий диск.</li>\n<li><strong>/proc</strong> - также особенная. Как бы это странно не звучало, но по существу такой директории вообще не существует. Содержит группы записей, которые отвечают за все процессы запущенные в системе. Большинство из этих записей можно посмотреть. Например, введите <strong>less /proc/cpuinfo</strong> и узнает, что ядро Linux-а думает о Вашем процессоре</li>\n<li><strong>/media</strong>, <strong>/mnt</strong> - обычные директории, которые используются особенным методом. Используются для монтирования различных устройств, например, cd-rom. Различные физические устройства (вроде жестких дисков) в Linux монтируются к определенным точкам. Перед тем как жесткий диск будет доступен (или флешка) он сначала должен быть монтирован в определенную точку. Когда система загружается она смотрит файл <strong>/etc/fstab</strong>, который как уже известно описывает, какое устройство куда монтировать. На современных дистрибутивах с графическими оболочками, обычному пользователю незачем переживать, поскольку при подключении нового устройства система автоматически это определит и смонтирует в папку <strong>/media</strong>. Для ручного монтирования обычно используется папка <strong>/mnt</strong> и команда <strong>mount</strong> (смотреть <strong>man mount</strong>)</li>\n</ul>\n<p>Во время своего путешествия по дереву каталогов думаю Вы заметили странный тип файлов</p>\n<pre><code class=\"hljs language-php\">lrwxrwxrwx   <span class=\"hljs-number\">1</span> root root    <span class=\"hljs-number\">31</span> <span class=\"hljs-number\">2011</span><span class=\"hljs-number\">-10</span><span class=\"hljs-number\">-04</span> <span class=\"hljs-number\">15</span>:<span class=\"hljs-number\">06</span> vmlinuz -&gt; /boot/vmlinuz<span class=\"hljs-number\">-2.6</span><span class=\"hljs-number\">.31</span><span class=\"hljs-number\">-21</span>-generic\n</code></pre>\n<p>Файлы которых часть прав начинается на букву <strong>l</strong> - называются ссылками. Они бывают 2 типов жесткие и символические. В данном случае - это символическая ссылка (на что на указывает стрелочка). Благодаря символических ссылкам файл/папка может иметь несколько имен. Это работает так: когда система получает файл, который является символической ссылкой, она делает маппинг на настоящий файл и работает с ним. Для создания ссылок используется команда <strong>ln</strong>.</p>\n<p>По мотивам <a href=\"http://linuxcommand.org\" target=\"_blank\" rel=\"noopener nofollow\">http://linuxcommand.org</a></p>","headings":[["komandy-raboty-s-fajlami","Команды работы с файлами"],["struktura-direktorij-i-ih-naznachenie","Структура директорий и их назначение"]],"id":"chto-nuzhno-znat-novichku-v-linux-ls-l-ili-naznachenie-osnovnykh-direktorij"}